# Mongo

***

## Import Libraries

In [1]:
import numpy as np
from numpy import count_nonzero, median, mean
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import random


import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns',None)
#pd.set_option('display.max_rows',None)
pd.set_option('display.width', 1000)
pd.set_option('display.float_format','{:.2f}'.format)

random.seed(0)
np.random.seed(0)
np.set_printoptions(suppress=True)

Autosaving every 60 seconds

## Exploratory Data Analysis

In [2]:
df = pd.read_json("catalog.json", lines=True)

In [3]:
df

            type    model  screen size  ram hard disk
0    smart phone  platina         5.50  NaN       NaN
1    smart phone     bn20         6.50  NaN       NaN
2    smart phone       cz         6.50  NaN       NaN
3    smart phone     xm23         5.50  NaN       NaN
4    smart phone       c3         6.50  NaN       NaN
..           ...      ...          ...  ...       ...
433   television      dj1        24.00  NaN       NaN
434   television      dj1        32.00  NaN       NaN
435   television      dj1        55.00  NaN       NaN
436   television      ss2        24.00  NaN       NaN
437   television      dj1        48.00  NaN       NaN

[438 rows x 5 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438 entries, 0 to 437
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   type         438 non-null    object
 1   model        438 non-null    object
 2   screen size  438 non-null    float64
 3   ram          389 non-null    object
 4   hard disk    389 non-null    object
dtypes: float64(1), object(4)
memory usage: 17.2+ KB

In [5]:
df.describe()

       screen size
count       438.00
mean         15.54
std           7.02
min           5.50
25%          12.00
50%          15.00
75%          17.00
max          55.00

In [6]:
df.columns

Index(['type', 'model', 'screen size', 'ram', 'hard disk'], dtype='object')

In [7]:
df.type.value_counts()

laptop         389
television      25
smart phone     24
Name: type, dtype: int64

### Task 5 - Write a query to find the count of laptops

In [8]:
(df["type"] == "laptop").sum()

389

### Task 6 - Write a query to find the number of mobile phones with screen size of 6 inches.

In [9]:
((df["type"] == "smart phone") & (df["screen size"] == 6.00)).sum()

8

### Task 7. Write a query to find out the average screen size of smart phones

In [10]:
smartphones = df[(df["type"] == "smart phone")]

In [11]:
smartphones["screen size"].mean()

6.0

### Task 8 - Export the fields _id, "type", "model", from the 'electronics' collection into a file named electronics.csv

In [12]:
df["fields_id"] = df.index

In [13]:
df

            type    model  screen size  ram hard disk  fields_id
0    smart phone  platina         5.50  NaN       NaN          0
1    smart phone     bn20         6.50  NaN       NaN          1
2    smart phone       cz         6.50  NaN       NaN          2
3    smart phone     xm23         5.50  NaN       NaN          3
4    smart phone       c3         6.50  NaN       NaN          4
..           ...      ...          ...  ...       ...        ...
433   television      dj1        24.00  NaN       NaN        433
434   television      dj1        32.00  NaN       NaN        434
435   television      dj1        55.00  NaN       NaN        435
436   television      ss2        24.00  NaN       NaN        436
437   television      dj1        48.00  NaN       NaN        437

[438 rows x 6 columns]

In [14]:
df2 = df[["fields_id", "type","model"]]
df2

     fields_id         type    model
0            0  smart phone  platina
1            1  smart phone     bn20
2            2  smart phone       cz
3            3  smart phone     xm23
4            4  smart phone       c3
..         ...          ...      ...
433        433   television      dj1
434        434   television      dj1
435        435   television      dj1
436        436   television      ss2
437        437   television      dj1

[438 rows x 3 columns]

In [15]:
df2.to_csv("electronics.csv", index=False)

#### Python code done by Dennis Lam